; domain
(define (domain delivery_x_1-domain)
 (:requirements :strips :typing :numeric-fluents)
 (:types room item arm bot)
 (:predicates (at_bot ?b - bot ?x - room) (at_ ?i - item ?x - room) (door ?x - room ?y - room) (free ?a - arm) (in_arm ?i - item ?a - arm) (in_tray ?i - item ?b - bot) (mount ?a - arm ?b - bot))
 (:functions (load_limit ?b - bot) (current_load ?b - bot) (weight ?i - item) (cost))
 (:action move
  :parameters ( ?b - bot ?x - room ?y - room)
  :precondition (and (at_bot ?b ?x) (door ?x ?y))
  :effect (and (at_bot ?b ?y) (not (at_bot ?b ?x)) (increase (cost) 3)))
 (:action pick
  :parameters ( ?i - item ?x - room ?a - arm ?b - bot)
  :precondition (and (at_ ?i ?x) (at_bot ?b ?x) (free ?a) (mount ?a ?b) (<= (+ (weight ?i) (current_load ?b)) (load_limit ?b)))
  :effect (and (in_arm ?i ?a) (not (at_ ?i ?x)) (not (free ?a)) (increase (current_load ?b) (weight ?i)) (increase (cost) 2)))
 (:action drop
  :parameters ( ?i - item ?x - room ?a - arm ?b - bot)
  :precondition (and (in_arm ?i ?a) (at_bot ?b ?x) (mount ?a ?b))
  :effect (and (free ?a) (at_ ?i ?x) (not (in_arm ?i ?a)) (decrease (current_load ?b) (weight ?i)) (increase (cost) 2)))
 (:action to_tray
  :parameters ( ?i - item ?a - arm ?b - bot)
  :precondition (and (in_arm ?i ?a) (mount ?a ?b))
  :effect (and (free ?a) (not (in_arm ?i ?a)) (in_tray ?i ?b) (increase (cost) 1)))
 (:action from_tray
  :parameters ( ?i - item ?a - arm ?b - bot)
  :precondition (and (in_tray ?i ?b) (mount ?a ?b) (free ?a))
  :effect (and (not (free ?a)) (in_arm ?i ?a) (not (in_tray ?i ?b)) (increase (cost) 1)))
)

; problem
(define (problem delivery_x_1-problem)
 (:domain delivery_x_1-domain)
 (:objects
   rooma roomb roomc - room
   item4 item3 item2 item1 - item
   left1 right1 left2 right2 - arm
   bot1 bot2 - bot
 )
 (:init (= (weight item4) 1) (= (weight item3) 1) (= (weight item2) 1) (= (weight item1) 1) (at_bot bot1 rooma) (at_bot bot2 rooma) (free left1) (free right1) (free left2) (free right2) (mount left1 bot1) (mount right1 bot1) (mount left2 bot2) (mount right2 bot2) (at_ item4 rooma) (at_ item3 rooma) (at_ item2 rooma) (at_ item1 rooma) (door rooma roomb) (door roomb rooma) (door rooma roomc) (door roomc rooma) (= (current_load bot1) 0) (= (load_limit bot1) 4) (= (current_load bot2) 0) (= (load_limit bot2) 4) (= (cost) 0))
 (:goal (and (at_ item4 roomb) (at_ item3 roomb) (at_ item2 roomc) (at_ item1 roomc)))
 (:metric minimize (cost))
)

; plan
1. (pick item1 rooma right1 bot1)
   deleted: (at_ item1 rooma) (free right1)
   added: (in_arm item1 right1)
   changed: (current_load bot1) from 0 to 1, (cost) from 0 to 2
   goals met: 0 of 4
2. (move bot1 rooma roomc)
   deleted: (at_bot bot1 rooma)
   added: (at_bot bot1 roomc)
   changed: (cost) from 2 to 5
   goals met: 0 of 4
3. (pick item4 rooma left2 bot2)
   deleted: (at_ item4 rooma) (free left2)
   added: (in_arm item4 left2)
   changed: (current_load bot2) from 0 to 1, (cost) from 5 to 7
   goals met: 0 of 4
4. (move bot2 rooma roomb)
   deleted: (at_bot bot2 rooma)
   added: (at_bot bot2 roomb)
   changed: (cost) from 7 to 10
   goals met: 0 of 4
5. (drop item4 roomb left2 bot2)
   deleted: (in_arm item4 left2)
   added: (free left2) (at_ item4 roomb)
   changed: (current_load bot2) from 1 to 0, (cost) from 10 to 12
   goals met: 1 of 4
6. (drop item1 roomc right1 bot1)
   deleted: (in_arm item1 right1)
   added: (free right1) (at_ item1 roomc)
   changed: (current_load bot1) from 1 to 0, (cost) from 12 to 14
   goals met: 2 of 4
7. (move bot2 roomb rooma)
   deleted: (at_bot bot2 roomb)
   added: (at_bot bot2 rooma)
   changed: (cost) from 14 to 17
   goals met: 2 of 4
8. (pick item2 rooma right2 bot2)
   deleted: (at_ item2 rooma) (free right2)
   added: (in_arm item2 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 17 to 19
   goals met: 2 of 4
9. (pick item3 rooma left2 bot2)
   deleted: (at_ item3 rooma) (free left2)
   added: (in_arm item3 left2)
   changed: (current_load bot2) from 1 to 2, (cost) from 19 to 21
   goals met: 2 of 4
10. (move bot2 rooma roomb)
   deleted: (at_bot bot2 rooma)
   added: (at_bot bot2 roomb)
   changed: (cost) from 21 to 24
   goals met: 2 of 4
11. (drop item3 roomb left2 bot2)
   deleted: (in_arm item3 left2)
   added: (free left2) (at_ item3 roomb)
   changed: (current_load bot2) from 2 to 1, (cost) from 24 to 26
   goals met: 3 of 4
12. (move bot2 roomb rooma)
   deleted: (at_bot bot2 roomb)
   added: (at_bot bot2 rooma)
   changed: (cost) from 26 to 29
   goals met: 3 of 4
13. (move bot2 rooma roomc)
   deleted: (at_bot bot2 rooma)
   added: (at_bot bot2 roomc)
   changed: (cost) from 29 to 32
   goals met: 3 of 4
14. (drop item2 roomc right2 bot2)
   deleted: (in_arm item2 right2)
   added: (free right2) (at_ item2 roomc)
   changed: (current_load bot2) from 1 to 0, (cost) from 32 to 34
   goals met: 4 of 4
